# FluidDensity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..FluidDensity Property
PipeFittingAndAccessoryData Class See Also
---
The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double FluidDensity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FluidDensity As Double
	Get
```

Visual C++
---
```text
public:
property double FluidDensity {
	double get ();
}
```

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace